In [1]:
import pandas as pd

In [2]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

In [5]:
purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [6]:
m=purchases['oranges']

0    0
1    3
2    7
3    2
Name: oranges, dtype: int64

In [7]:
n=purchases[['oranges']]

In [8]:
type(n)

pandas.core.frame.DataFrame

In [10]:
purchases1 = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

In [11]:
purchases1

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [13]:
purchases1.loc['Lily']

apples     0
oranges    7
Name: Lily, dtype: int64

In [14]:
purchases.columns

Index(['apples', 'oranges'], dtype='object')

In [17]:
import os

In [18]:
os.getcwd()

'/Users/misky/Desktop/DATA SCIENCE 2020'

In [43]:
movies=pd.read_csv("imdb.csv", index_col='Rank')

In [44]:
movies.head(2)

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0

In [53]:
data2=pd.read_json('http://jsonplaceholder.typicode.com/todos')

In [54]:
data2.head(5)

   userId  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

In [58]:
data3=data2.set_index('id')

In [82]:
data3

     userId                                              title  completed
id
1         1                                 delectus aut autem      False
2         1                 quis ut nam facilis et officia qui      False
3         1                                fugiat veniam minus      False
4         1                                   et porro tempora       True
5         1  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...                                                ...        ...
196      10                consequuntur aut ut fugit similique       True
197      10                  dignissimos quo nobis earum saepe       True
198      10                       quis eius est sint explicabo       True
199      10                       numquam repellendus a magnam       True
200      10                       ipsam aperiam voluptates qui      False

[200 rows x 3 columns]

!sudo pip3 install psycopg2

In [ ]:
import psycopg2 as ps

conn=ps.connect("dbname=sales_demo user=postgres host=localhost password=Miskitoo.1998")

In [ ]:
query="select * from inventories"

In [ ]:
pdinvent=pd.read_sql(query,conn)

In [ ]:
pdinvent.head(2)